tap "bjarneo/cliamp"
tap "rgcr/formulae"
tap "tldev/tap"
tap "tw93/tap"
brew "aws-sam-cli"
brew "awscli"
brew "btop"
brew "coreutils"
brew "ffmpeg"
brew "fish"
brew "fzf"
brew "gawk"
brew "gcc"
brew "gh"
brew "gnu-getopt"
brew "gnu-indent"
brew "gnu-sed"
brew "gnu-tar"
brew "go"
brew "grpcui"
brew "httpie"
brew "ipcalc"
brew "k6"
brew "k9s"
brew "kubevpn"
brew "mackup"
brew "mas"
brew "mise"
brew "neovim"
brew "starship"
brew "stow"
brew "tailspin"
brew "tmux"
brew "tree"
brew "wget"
brew "woff2"
brew "bjarneo/cliamp/cliamp"
brew "rgcr/formulae/m-cli"
cask "alacritty"
cask "android-platform-tools"
cask "conductor"
cask "cursor"
cask "datagrip"
cask "droid"
cask "font-fira-code"
cask "font-geist"
cask "font-maple-mono"
cask "font-maple-mono-cn"
cask "font-maple-mono-nf"
cask "font-maple-mono-nf-cn"
cask "font-monaspace"
cask "gcloud-cli"
cask "ghostty"
cask "google-chrome"
cask "iina"
cask "iina+"
cask "itsycal"
cask "karabiner-elements"
cask "keka"
cask "kitty"
cask "notion"
cask "openinterminal"
cask "orbstack"
cask "raycast"
cask "setapp"
cask "slack"
cask "surge"
cask "tailscale-app"
cask "thebrowsercompany-dia"
cask "utm"
cask "virtualbuddy"
cask "visual-studio-code"
cask "wechat"
cask "wetype"
cask "yaak"
cask "zed"
mas "Bob", id: 1630034110
mas "Dropover", id: 1355679052
mas "Things", id: 904280696
vscode "anthropic.claude-code"
vscode "wiidede.liquid-ray"
go "golang.org/x/tools/gopls"
