tap "apple/apple", "http://github.com/apple/homebrew-apple"
tap "appleboy/tap"
tap "bigwig-club/brew"
tap "buildpacks/tap"
tap "code-hex/tap"
tap "datawire/blackbird"
tap "epk/epk"
tap "genkiroid/cert"
tap "go-task/tap"
tap "hashicorp/tap"
tap "he3-app/he3"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "jandedobbeleer/oh-my-posh"
tap "jysperm/leftover-scanner"
tap "knative-extensions/kn-plugins"
tap "knative/client"
tap "localsend/localsend"
tap "mac-cleanup/mac-cleanup-py"
tap "minio/stable"
tap "shivammathur/php"
tap "wez/wezterm"
tap "xpipe-io/tap"
tap "zaru/jobcan"
brew "adns"
brew "aliyunpan"
brew "libpng"
brew "xz"
brew "aom"
brew "openssl@3"
brew "argocd"
brew "autoconf"
brew "python@3.11"
brew "autojump"
brew "automake"
brew "aws-sam-cli"
brew "awscli"
brew "bash-completion@2"
brew "libssh2"
brew "bat"
brew "bison"
brew "btop"
brew "glib"
brew "coreutils"
brew "unbound"
brew "gnutls"
brew "emacs"
brew "cask"
brew "cfn-lint"
brew "cilium-cli"
brew "cmctl"
brew "rtmpdump"
brew "libsodium"
brew "composer"
brew "crane"
brew "croc"
brew "detect-secrets"
brew "dive"
brew "docker"
brew "docker-compose"
brew "dust"
brew "eksctl"
brew "faac"
brew "fd"
brew "harfbuzz"
brew "python@3.12"
brew "libass"
brew "mpg123"
brew "libssh"
brew "pango"
brew "srt"
brew "tesseract"
brew "ffmpeg"
brew "gcc"
brew "pmix"
brew "findutils"
brew "node"
brew "firebase-cli"
brew "fish"
brew "fisher"
brew "fpp"
brew "fzf"
brew "gawk"
brew "gcal"
brew "gdk-pixbuf"
brew "gh"
brew "ghostscript"
brew "glow"
brew "gnu-getopt"
brew "gnu-indent"
brew "gnu-sed"
brew "gnu-tar"
brew "libksba"
brew "pinentry"
brew "gnupg"
brew "go"
brew "go-task"
brew "pkgconf"
brew "gobject-introspection"
brew "gotop"
brew "gpgme"
brew "netpbm"
brew "librsvg"
brew "graphviz"
brew "grep"
brew "grpcui"
brew "grpcurl"
brew "helm"
brew "helmfile"
brew "hey"
brew "htop"
brew "httpie"
brew "hugo"
brew "iftop"
brew "libheif"
brew "libraw"
brew "imagemagick"
brew "inetutils"
brew "ipcalc"
brew "iperf"
brew "iperf3"
brew "iproute2mac"
brew "istioctl"
brew "jq"
brew "k6"
brew "k9s"
brew "kind"
brew "kubectl-ai"
brew "kubernetes-cli"
brew "kubeshark"
brew "kubevpn"
brew "kustomize"
brew "lazygit"
brew "lftp"
brew "libmediainfo"
brew "libvo-aacenc"
brew "lima"
brew "llvm"
brew "mackup"
brew "mcrypt"
brew "media-info"
brew "minikube"
brew "mise"
brew "mosh"
brew "yt-dlp"
brew "mpv"
brew "msgpack"
brew "mtr"
brew "ncdu"
brew "neofetch"
brew "neovim"
brew "nghttp2"
brew "nmap"
brew "nvm"
brew "ollama", restart_service: :changed
brew "onefetch"
brew "openconnect"
brew "openjdk"
brew "openjdk@17"
brew "pkcs11-helper"
brew "openvpn"
brew "pdm"
brew "podman"
brew "poppler"
brew "postgresql@14"
brew "pre-commit"
brew "python@3.10"
brew "python-tk@3.10"
brew "tcl-tk"
brew "python@3.8"
brew "python@3.9"
brew "qemu"
brew "rust"
brew "sapling"
brew "shadowsocks-libev"
brew "skaffold"
brew "skopeo"
brew "sniffnet"
brew "socat"
brew "sslyze"
brew "starship"
brew "stow"
brew "stress-ng"
brew "tcptrace"
brew "tcptraceroute"
brew "telnet", link: false
brew "wireshark"
brew "termshark"
brew "thefuck"
brew "tig"
brew "tmux"
brew "tree"
brew "trufflehog"
brew "urlview"
brew "vegeta"
brew "vips"
brew "vnstat"
brew "watch"
brew "wget"
brew "wrangler"
brew "wrk"
brew "yasm"
brew "yq"
brew "appleboy/tap/codegpt"
brew "buildpacks/tap/pack"
brew "hashicorp/tap/terraform"
brew "jandedobbeleer/oh-my-posh/oh-my-posh"
brew "knative-extensions/kn-plugins/func"
brew "knative-extensions/kn-plugins/quickstart"
brew "knative/client/kn"
brew "mac-cleanup/mac-cleanup-py/mac-cleanup-py"
brew "minio/stable/mc"
brew "shivammathur/php/php@7.2"
cask "alacritty"
cask "cloudflare-warp"
cask "cursor"
cask "devtoys"
cask "font-fira-code"
cask "font-maple-mono"
cask "font-maple-mono-cn"
cask "font-maple-mono-nf"
cask "font-maple-mono-nf-cn"
cask "font-monaspace"
cask "ghostty"
cask "google-chrome"
cask "google-cloud-sdk"
cask "headlamp"
cask "iina"
cask "iina+"
cask "input-source-pro"
cask "itsycal"
cask "jordanbaird-ice"
cask "karabiner-elements"
cask "kitty"
cask "localsend"
cask "maczip"
cask "mitmproxy"
cask "ngrok"
cask "notion"
cask "notion-calendar"
cask "obs"
cask "openinterminal"
cask "openlens"
cask "orbstack"
cask "parsec"
cask "postman"
cask "prismlauncher"
cask "raycast"
cask "slack"
cask "stats"
cask "surge"
cask "tailscale-app"
cask "telegram"
cask "utm"
cask "virtualbuddy"
cask "visual-studio-code"
cask "wechat"
cask "whisky"
cask "zoom"
vscode "apvarun.celestial"
vscode "catppuccin.catppuccin-vsc"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "eamodio.gitlens"
vscode "fabiospampinato.vscode-open-in-terminal"
vscode "fey.oscura"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "gruntfuggly.todo-tree"
vscode "hashicorp.terraform"
vscode "jdinhlife.gruvbox"
vscode "jianbingfang.dupchecker"
vscode "k6.k6"
vscode "mechatroner.rainbow-csv"
vscode "miguelsolorio.symbols"
vscode "mikestead.dotenv"
vscode "mohsen1.prettify-json"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.kind-vscode"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.python"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.sublime-keybindings"
vscode "naumovs.color-highlight"
vscode "oderwat.indent-rainbow"
vscode "openai.openai-chatgpt-adhoc"
vscode "pentium10.vscode-gcp-project-switcher"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "tim-koehler.helm-intellisense"
vscode "vadimcn.vscode-lldb"
vscode "xaver.clang-format"
vscode "zxh404.vscode-proto3"
