tap "apple/apple", "http://github.com/apple/homebrew-apple"
tap "appleboy/tap"
tap "bigwig-club/brew"
tap "buildpacks/tap"
tap "charmbracelet/tap"
tap "clawscli/tap"
tap "code-hex/tap"
tap "datawire/blackbird"
tap "epk/epk"
tap "f1bonacc1/tap"
tap "farion1231/ccswitch"
tap "fluxcd/tap"
tap "gaurav-gosain/tap"
tap "genkiroid/cert"
tap "go-task/tap"
tap "hashicorp/tap"
tap "he3-app/he3"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "jandedobbeleer/oh-my-posh"
tap "jysperm/leftover-scanner"
tap "knative-extensions/kn-plugins"
tap "knative/client"
tap "leg100/tap"
tap "libsql/sqld"
tap "localsend/localsend"
tap "mac-cleanup/mac-cleanup-py"
tap "minio/stable"
tap "oven-sh/bun"
tap "shivammathur/php"
tap "tursodatabase/tap"
tap "tw93/tap"
tap "wez/wezterm"
tap "xpipe-io/tap"
tap "zaru/jobcan"
brew "adns"
brew "aliyunpan"
brew "libpng"
brew "xz"
brew "aom"
brew "openssl@3"
brew "argocd"
brew "autoconf"
brew "python@3.11"
brew "autojump"
brew "automake"
brew "aws-sam-cli"
brew "awscli"
brew "bash-completion@2"
brew "libssh2"
brew "bat"
brew "bison"
brew "btop"
brew "glib"
brew "coreutils"
brew "unbound"
brew "gnutls"
brew "emacs"
brew "cask"
brew "cfn-lint"
brew "cilium-cli"
brew "cmctl"
brew "rtmpdump"
brew "libsodium"
brew "composer"
brew "crane"
brew "croc"
brew "detect-secrets"
brew "dive"
brew "docker"
brew "docker-compose"
brew "dust"
brew "eksctl"
brew "faac"
brew "fd"
brew "harfbuzz"
brew "python@3.12"
brew "libass"
brew "mpg123"
brew "libssh"
brew "pango"
brew "srt"
brew "tesseract"
brew "ffmpeg"
brew "gcc"
brew "pmix"
brew "findutils"
brew "fish"
brew "fisher"
brew "fpp"
brew "fzf"
brew "gawk"
brew "gdk-pixbuf"
brew "gh"
brew "ghostscript"
brew "glow"
brew "gnu-getopt"
brew "gnu-indent"
brew "gnu-sed"
brew "gnu-tar"
brew "libksba"
brew "pinentry"
brew "gnupg"
brew "go"
brew "go-task"
brew "pkgconf"
brew "gobject-introspection"
brew "gotop"
brew "gpgme"
brew "netpbm"
brew "librsvg"
brew "graphviz"
brew "grep"
brew "grpcui"
brew "grpcurl"
brew "helm"
brew "helmfile"
brew "hey"
brew "htop"
brew "httpie"
brew "hugo"
brew "iftop"
brew "libheif"
brew "libraw"
brew "imagemagick"
brew "inetutils"
brew "ipcalc"
brew "iperf"
brew "iperf3"
brew "iproute2mac"
brew "istioctl"
brew "jq"
brew "k6"
brew "k9s"
brew "kind"
brew "kubernetes-cli"
brew "krew"
brew "kubectl-ai"
brew "kubeshark"
brew "kubevpn"
brew "kustomize"
brew "lazygit"
brew "lftp"
brew "libmediainfo"
brew "libvo-aacenc"
brew "lima"
brew "llvm"
brew "mackup"
brew "media-info"
brew "minikube"
brew "mise"
brew "mosh"
brew "yt-dlp"
brew "mpv"
brew "msgpack"
brew "mtr"
brew "ncdu"
brew "neofetch"
brew "neovim"
brew "nghttp2"
brew "nmap"
brew "nvm"
brew "onefetch"
brew "openconnect"
brew "pkcs11-helper"
brew "openvpn"
brew "pdm"
brew "podman"
brew "poppler"
brew "postgresql@14"
brew "pre-commit"
brew "tcl-tk"
brew "ripgrep"
brew "rust"
brew "skopeo"
brew "sniffnet"
brew "socat"
brew "starship"
brew "stow"
brew "stress-ng"
brew "tcptrace"
brew "tcptraceroute"
brew "telnet", link: false
brew "thefuck"
brew "tig"
brew "tmux"
brew "tree"
brew "trufflehog"
brew "tuios"
brew "urlview"
brew "uv"
brew "vegeta"
brew "vips"
brew "vnstat"
brew "watch"
brew "wget"
brew "woff2"
brew "wrangler"
brew "wrk"
brew "yasm"
brew "yq"
brew "appleboy/tap/codegpt"
brew "knative-extensions/kn-plugins/func"
brew "knative-extensions/kn-plugins/quickstart"
brew "knative/client/kn"
brew "oven-sh/bun/bun"
brew "tw93/tap/mole"
cask "alacritty"
cask "anki"
cask "conductor"
cask "cursor"
cask "dataflare"
cask "datagrip"
cask "devtoys"
cask "droid"
cask "font-fira-code"
cask "font-maple-mono"
cask "font-maple-mono-cn"
cask "font-maple-mono-nf"
cask "font-maple-mono-nf-cn"
cask "font-monaspace"
cask "gcloud-cli"
cask "ghostty"
cask "google-chrome"
cask "iina"
cask "iina+"
cask "input-source-pro"
cask "itsycal"
cask "jordanbaird-ice"
cask "karabiner-elements"
cask "kitty"
cask "localsend"
cask "maczip"
cask "notion"
cask "openinterminal"
cask "orbstack"
cask "postman"
cask "pug"
cask "raycast"
cask "slack"
cask "stats"
cask "surge"
cask "tailscale-app"
cask "telegram"
cask "utm"
cask "virtualbuddy"
cask "visual-studio-code"
cask "wechat"
cask "whisky"
cask "yaak"
cask "zed"
go "github.com/golangci/golangci-lint/cmd/golangci-lint"
go "golang.org/x/tools/gopls"
go "github.com/ashish0kumar/gostty"
go "honnef.co/go/tools/cmd/staticcheck"
go "github.com/ashish0kumar/stormy"
cargo "zellij"
